---
title: ViewFamilyType
classe: Autodesk.Revit.DB.ViewFamilyType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ViewFamilyType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId DefaultTemplateId { get; set; }` | `viewFamilyType.DefaultTemplateId` | ElementId |
| `PlanViewDirection PlanViewDirection { get; set; }` | `viewFamilyType.PlanViewDirection` | PlanViewDirection |
| `ViewFamily ViewFamily { get; }` | `viewFamilyType.ViewFamily` | ViewFamily |
| `Boolean IsValidDefaultTemplate(ElementId)` | `viewFamilyType.IsValidDefaultTemplate(templateId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```